apps/backend/load-tests/scenarios/scenario-02-slow-postgres-query.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 30
      arrivalRate: 2
      name: 'Warm-up'
    - duration: 180
      arrivalRate: 5
      name: 'Sustained — observe consistent 500ms latency'
  defaults:
    headers:
      Content-Type: 'application/json'
  variables:
    apiPrefix: '/api'

scenarios:
  - name: 'S2 - Product listing (single slow DB span)'
    flow:
      - get:
          url: '{{ apiPrefix }}/products?page=1&limit=20'
      - think: 3
      - get:
          url: '{{ apiPrefix }}/products?page=2&limit=20'
      - think: 3