apps/backend/load-tests/scenarios/scenario-04-redis-cache-not-working.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 30
      arrivalRate: 5
      name: 'Warm-up'
    - duration: 180
      arrivalRate: 30
      name: 'Sustained — every request hits DB, no cache hits'
  defaults:
    headers:
      Content-Type: 'application/json'
  variables:
    apiPrefix: '/api'

scenarios:
  - name: 'S4 - Product reads (100% cache miss)'
    flow:
      - get:
          url: '{{ apiPrefix }}/products?page=1&limit=20'
      - think: 1
      - get:
          url: '{{ apiPrefix }}/products?page=2&limit=20'
      - think: 1
      - get:
          url: '{{ apiPrefix }}/products?page=1&limit=20'
      - think: 2