apps/backend/load-tests/scenarios/scenario-06-n-plus-one-query.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 30
      arrivalRate: 3
      name: 'Warm-up'
    - duration: 180
      arrivalRate: 10
      name: 'Sustained — N+1 DB queries per request'
  defaults:
    headers:
      Content-Type: 'application/json'
  variables:
    apiPrefix: '/api'

scenarios:
  - name: 'S6 - Product listing (N+1 variant queries)'
    flow:
      - get:
          url: '{{ apiPrefix }}/products?page=1&limit=20'
      - think: 3
      - get:
          url: '{{ apiPrefix }}/products?page=2&limit=20'
      - think: 3