apps/backend/load-tests/scenarios/scenario-08-memory-leak.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 3
      name: 'Warm-up'
    - duration: 300
      arrivalRate: 10
      name: 'Sustained — heap grows continuously (needs 5+ min to be visible)'
  defaults:
    headers:
      Content-Type: 'application/json'
  variables:
    apiPrefix: '/api'

scenarios:
  - name: 'S8 - Product listing (heap grows with every request)'
    flow:
      - get:
          url: '{{ apiPrefix }}/products?page=1&limit=20'
      - think: 2
      - get:
          url: '{{ apiPrefix }}/products?page=2&limit=20'
      - think: 2
      - get:
          url: '{{ apiPrefix }}/products?page=1&limit=20'
      - think: 3