apps/backend/load-tests/scenarios/scenario-10-postgres-locks.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 30
      arrivalRate: 1
      name: 'Warm-up'
    - duration: 180
      arrivalRate: 3
      name: 'Sustained — concurrent orders for same product serialize behind lock'
  defaults:
    headers:
      Content-Type: 'application/json'
  variables:
    apiPrefix: '/api'
    testUserEmail: 'loadtest1@example.com'
    testUserPassword: 'LoadTest123!'

scenarios:
  - name: 'S10 - Concurrent orders (10s lock hold per transaction)'
    flow:
      - post:
          url: '{{ apiPrefix }}/auth/login'
          json:
            email: '{{ testUserEmail }}'
            password: '{{ testUserPassword }}'
          capture:
            json: '$.accessToken'
            as: 'accessToken'
      - post:
          url: '{{ apiPrefix }}/orders'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          json: {}
      - think: 1